#### Terraform Plan Output
```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_user.usu01 will be created
  + resource "aws_iam_user" "usu01" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "usu01"
      + path          = "/"
      + tags          = {
          + "manual" = "true"
        }
      + tags_all      = {
          + "manual" = "true"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user.usu02 will be created
  + resource "aws_iam_user" "usu02" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "usu02"
      + path          = "/"
      + tags          = {
          + "manual" = "true"
        }
      + tags_all      = {
          + "manual" = "true"
        }
      + unique_id     = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + user01 = {
      + arn                  = (known after apply)
      + force_destroy        = false
      + id                   = (known after apply)
      + name                 = "usu01"
      + path                 = "/"
      + permissions_boundary = null
      + tags                 = {
          + manual = "true"
        }
      + tags_all             = {
          + manual = "true"
        }
      + unique_id            = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
